In [1]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2], 'B': [10, 20]})
df

   A   B
0  1  10
1  2  20

In [2]:
def square(x):
    return x * x


df1 = df.apply(square)
print(df1)

   A    B
0  1  100
1  4  400

In [3]:
print(df)

   A   B
0  1  10
1  2  20

In [4]:
# 2. apply() with lambda
df1 = df.apply(lambda x: x * x)
df1

   A    B
0  1  100
1  4  400

In [5]:
# apply along axis
import pandas as pd
import numpy as np

df = pd.DataFrame({'A': [1, 2], 'B': [10, 20]})
print("df---\n",df)

df1 = df.apply(np.sum, axis=0)
print(df1)

df1 = df.apply(np.sum, axis=1)
print(df1)

df---
    A   B
0  1  10
1  2  20
A     3
B    30
dtype: int64
0    11
1    22
dtype: int64

In [6]:
# reference link to apply function.
# https://www.digitalocean.com/community/tutorials/pandas-dataframe-apply-examples

In [4]:
import pandas as pd
import numpy as np

data = pd.read_excel(r"C:\jaya sri\project 2\all_input_files.xlsx") 
data

      NDC_NBR  DCR_DRUG_LST_ID
0       10001                1
1       10001                2
2       10001                3
3       10001                4
4       10001                5
...       ...              ...
1006    10062               56
1007    10062               57
1008    10062               58
1009    10062               59
1010    10062               60

[1011 rows x 2 columns]

In [14]:
df=data.apply(lambda x: x['NDC_NBR'],axis=1)[1007]
df

10062

In [10]:
import pandas as pd
df=pd.DataFrame({'Name':['Ram','Santoosh','Param'],'Marks':[20,25,30]})
df

       Name  Marks
0       Ram     20
1  Santoosh     25
2     Param     30

In [11]:
print(df.iloc[1])

Name     Santoosh
Marks          25
Name: 1, dtype: object

In [13]:
df1=df.apply(lambda i:i['Name'],axis=1)[1]
df1

'Santoosh'

In [5]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2], 'B': [10, 20]})


def square(x):
    return x * x


df1 = df.apply(square)

print(df)
print(df1)

   A   B
0  1  10
1  2  20
   A    B
0  1  100
1  4  400

In [7]:
df_new=df.apply(lambda i:i['A'],axis=1)[1]
df_new

2